# Introduction to Pandas with SQLite

In [1]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore")

##Â Create a connection

In [4]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [5]:
cur.execute("SELECT * FROM customer")
cur.fetchall()

[('Favio', 'Vazquez', 4300.0),
 ('Sri', 'Ambati', 3000.0),
 ('Sandeep', 'Desai', 20000.0),
 ('Anu', 'Gaur', 4020.5)]

## Creation of a Dataframe (Pandas)

In [6]:
df = pd.read_sql_query("SELECT * FROM customer", conn)

In [7]:
df

      name last_name   income
0    Favio   Vazquez   4300.0
1      Sri    Ambati   3000.0
2  Sandeep     Desai  20000.0
3      Anu      Gaur   4020.5

## Run queries from Pandas

In [8]:
pd.read_sql("select * from customer", conn)

      name last_name   income
0    Favio   Vazquez   4300.0
1      Sri    Ambati   3000.0
2  Sandeep     Desai  20000.0
3      Anu      Gaur   4020.5

In [9]:
pd.read_sql("select * from customer where name = 'Favio'", conn)

    name last_name  income
0  Favio   Vazquez  4300.0

In [11]:
pd.read_sql("select name, last_name from customer", conn)

      name last_name
0    Favio   Vazquez
1      Sri    Ambati
2  Sandeep     Desai
3      Anu      Gaur

In [12]:
pd.read_sql("select name, last_name from customer order by last_name", conn)

      name last_name
0      Sri    Ambati
1  Sandeep     Desai
2      Anu      Gaur
3    Favio   Vazquez

## Read CSV file from Pandas

In [14]:
pd.read_csv("sample.csv")

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [15]:
sample_df = pd.read_csv("sample.csv")

In [16]:
type(sample_df)

pandas.core.frame.DataFrame

In [18]:
sample_df.head(2)

    Name  Age
0  Favio   31
1  Marco   25

## Creating a table in SQLite from a CSV file with Pandas

In [19]:
sample_df = pd.read_csv("sample.csv")

In [20]:
sample_df.to_sql("sample_table", conn, if_exists="replace", index=False)

In [21]:
pd.read_sql("select * from sample_table", conn)

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [24]:
sample_df.columns

Index(['Name', 'Age'], dtype='object')

## Function to get all the tables info

In [22]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [28]:
def table_info(conn,cursor):
    """
    prints out all of the columns of every table in the DB
    
    conn: database connection object
    cursor: cursor object
    """
    
    tables = cur.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
    for table_name in tables:
        table_name = table_name[0]
        table = pd.read_sql_query("SELECT * from {} LIMIT 0".format(table_name), conn)
        print(table_name)
        for col in table.columns:
            print("\t "+ col)
            print()

In [29]:
table_info(conn,cur)

customer
	 name

	 last_name

	 income

sample_table
	 Name

	 Age

## See table schema with SQlite

In [31]:
cur.execute("PRAGMA table_info('customer')").fetchall()

[(0, 'name', 'TEXT', 0, None, 0),
 (1, 'last_name', 'TEXT', 0, None, 0),
 (2, 'income', 'REAL', 0, None, 0)]

Every row includes:

- Index of the column
- Column Name
- Data type
- Whether or not the column can be NULL
- The default value for the column
- The primary key in the result is 0 for columns that are not the primary key